renesas/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx261/r_lpc_rx261.c
        if (((0 == SYSTEM.MSTPCRA.BIT.MSTPA28) 
            && ((1 == DTC.DTCST.BIT.DTCST) || (1 == DMAC.DMAST.BIT.DMST))) && (0 == SYSTEM.SNZCR.BIT.SNZDTCE))
        {
            return LPC_ERR_ILLEGAL;         /* Cannot enter SW_Stanbay if DMAC/DTC is enabled */
        }
    }

    /* Parameter check here to insure that if we are entering sleep mode with return clock switching
     * enabled then, only the Sub-clock is being used to enter sleep and if the return mode is Middle
     * Speed mode that the system clock will be less than limit
     */
    else if ((0x0 == SYSTEM.MSTPCRC.BIT.DSLPE) && /* Check if entering Sleep Mode */
            (LPC_CLOCK_SWITCH_ENABLE == SYSTEM.RSTCKCR.BIT.RSTCKEN)) /* If Return Clock Switching is enabled */
    {
        /* When entering sleep mode with return clock switching enabled, the system clock must be the sub-clock */
        if (LPC_SUB_CLOCK != SYSTEM.SCKCR3.WORD)
        {
            return LPC_ERR_ILL_CLOCK_SOURCE; /* Cannot enter Sleep if SubClock is not system clock */
        }

        if (LPC_MEDIUM_SPD == SYSTEM.OPCCR.BIT.OPCM) /* if return mode is medium speed mode */
        {
            rstckcr_rstcksel = (SYSTEM.RSTCKCR.BYTE & 0x07);
            switch (rstckcr_rstcksel)
            {
                case LPC_HOCO:  /* If HOCO is chosen as the return clock */

                    /* Exiting from sleep-mode to medium-speed mode with the HOCO selected is not permitted */
                    return LPC_ERR_ILL_CLOCK_SOURCE;
                    break;

                case LPC_MAIN_OSC:  /* If Main Clock is chosen as the return clock */
#if ((BSP_CFG_MCU_VCC_MV > 2399) || (BSP_CFG_MCU_VCC_MV <= 1799))
                    /* When exiting sleep-mode to medium-speed mode with the main clock oscillator selected,
                     * the system clock frequency does not exceed the limit */
                    if (((((((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.ICK) > LPC_MAX_ICLK_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.FCK) > LPC_MAX_FCLK_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKA) > LPC_MAX_PCLKA_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKB) > LPC_MAX_PCLKB_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKD) > LPC_MAX_PCLKD_MID_SPEED_FREQ_HZ))
                    {
                        return LPC_ERR_ILL_MAIN_CLK_FREQ;
                    }
#elif (BSP_CFG_MCU_VCC_MV > 1799)
                    /* When exiting sleep-mode to medium-speed mode with the main clock oscillator selected,
                     * the system clock frequency does not exceed the limit */
                    /* RSIP enable */
                    if (0 == SYSTEM.MSTPCRD.BIT.MSTPD31)
                    {
                        if (((((((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.ICK) > LPC_MAX_RSIP_ENABLE_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.FCK) > LPC_MAX_RSIP_ENABLE_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKA) > LPC_MAX_RSIP_ENABLE_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKB) > LPC_MAX_RSIP_ENABLE_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKD) > LPC_MAX_RSIP_ENABLE_MID_SPEED_FREQ_HZ))
                        {
                            return LPC_ERR_ILL_MAIN_CLK_FREQ;
                        }
                    }
                    /* RSIP disable */
                    else
                    {
                        if (((((((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.ICK) > LPC_MAX_ICLK_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.FCK) > LPC_MAX_FCLK_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKA) > LPC_MAX_PCLKA_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKB) > LPC_MAX_PCLKB_MID_SPEED_FREQ_HZ))
                            || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKD) > LPC_MAX_PCLKD_MID_SPEED_FREQ_HZ))
                        {
                            return LPC_ERR_ILL_MAIN_CLK_FREQ;
                        }
                    }
#endif
                    break;
                default:

                    /* nothing here */
                    break;
            }
        }
        else if (LPC_MEDIUM_SPD_2 == SYSTEM.OPCCR.BIT.OPCM) /* if return mode is medium speed mode2 */
        {
            rstckcr_rstcksel = (SYSTEM.RSTCKCR.BYTE & 0x07);
            switch (rstckcr_rstcksel)
            {
                case LPC_HOCO:  /* If HOCO is chosen as the return clock */

                    /* Exiting from sleep-mode to medium-speed mode 2 with the HOCO selected is not permitted */
                    return LPC_ERR_ILL_CLOCK_SOURCE;
                    break;

                case LPC_MAIN_OSC:  /* If Main Clock is chosen as the return clock */

                    /* Exiting from sleep-mode to medium-speed mode 2 with the main clock selected is not permitted */
                    return LPC_ERR_ILL_CLOCK_SOURCE;
                    break;
                default:

                    /* nothing here */
                    break;
            }
        }
        else
        {
            /* nothing here */
        }
    }
    else if (0x1 == SYSTEM.MSTPCRC.BIT.DSLPE)
    {
        /* Check FENTRY0(b0) and FENTRYD(b7) */
        if (0x0000 != (FLASH.FENTRYR.WORD & 0x0081))
        {
            return LPC_ERR_ILLEGAL;             /* Cannot enter Deep Sleep if P/E mode entry */
        }
        
        if (0 == SYSTEM.MSTPCRA.BIT.MSTPA28)
        {
            return LPC_ERR_DEEP_SLEEP_STATUS;   /* Cannot enter Deep Sleep if DTC is enabled */
        }
    }
    else
    {
        /* nothing here */
    }

    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_lowpower_activate_check
 ********************************************************************************************************************/

#endif /* LPC_CFG_PARAM_CHECKING_ENABLE */

/*********************************************************************************************************************
 * Function Name: lpc_snooze_release_isr
 * Description  :  snooze Interrupt
 * Arguments    : void
 ********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (lpc_snooze_release_isr, VECT(SYSTEM, SNZI))
R_BSP_ATTRIB_STATIC_INTERRUPT void lpc_snooze_release_isr(void)
{
    if ((NULL != psnooze_release_callback) && (FIT_NO_FUNC != psnooze_release_callback))
    {
        psnooze_release_callback (FIT_NO_PTR);
    }
}
/*********************************************************************************************************************
 End of function lpc_snooze_release_isr
 ********************************************************************************************************************/


#endif /* BSP_MCU_RX261 */


/***********************************************************************************************************************
 * End of File
 ***********************************************************************************************************************/
